disruptivepatternmaterial/M5StickCPlus2_Remote_For_DJI_Osmo/sdkconfig.defaults.m5atoms3
# M5 AtomS3 — ESP32-S3FN8 (8MB Flash, NO PSRAM).
# See docs/ATOMS3_MIGRATION_SPEC.md (D-003) for the no-PSRAM rationale.
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth (match Plus2 / StickS3 BLE feature set)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Flash 8MB (QIO)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# No PSRAM — ESP32-S3FN8 ships without it (R1).
CONFIG_SPIRAM=n

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS — same headroom as StickS3 for BLE callback storms.
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_BT_BTC_TASK_STACK_SIZE=4096

CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# BLE-only camera remote: keep Wi-Fi off (same reason as StickS3).
CONFIG_ESP_WIFI_ENABLED=n

# No battery sleep requirement on AtomS3 (USB-only powered).
CONFIG_PM_ENABLE=n
